//count word
let p = prompt("Хайх үгээ оруулна уу");

let data = ['Засгийн', 'газарт', '6.4', 'сая', 'тонн', 'нүүрс', 'алдагдсан', 'гэх', 'мэдээлэл', 'ирээгүй', 'байна.', 'Бодит', 'Бодит', 'Бодит', 'их', 'хэмжээний', 'нүүрс', 'алдагдсан', 'гэх', 'асуудал', 'байна', 'байна.', 'Хууль', 'хяналтын', 'байгууллага', 'хяналт', 'шалгалтын', 'ажил', 'явуулж', 'байна'];
let count = 0;

for(let i = 0; i < data.length; i++){
    if(data[i] === p){
        count = count + 1;
    }
}
console.log(`🧮 ${p} gedeg ug: ${count} orson baina.`);


